[Killed] BlockStatement
src/index.ts:25:63
    * @param type - Optional type label (e.g., 'Redis', 'Axios'). If omitted, inferred from constructor
    * @throws Error if name is already registered
    */
-  register<T>(name: string, instance: T, type?: string): void {
-    if (this.#entries.has(name)) {
-      throw new Error(`Instance '${name}' already registered`);
-    }
-
-    // Safe access to constructor for type inference
-    const instanceObj = instance as { constructor?: { name?: string } };
-    const constructorName = instanceObj.constructor?.name || "Unknown";
-
-    const entry: RegistryEntry<T> = {
-      name,
-      instance,
-      type: type || constructorName,
-      constructor: (instanceObj.constructor || Object) as new (...args: unknown[]) => unknown,
-    };
-
-    this.#entries.set(name, entry);
-  }
+  register<T>(name: string, instance: T, type?: string): void {}
 
   /**
killedBy: Registry - Vanilla JavaScript register should store an instance with a unique name
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/index.ts:26:9
    * @throws Error if name is already registered
    */
   register<T>(name: string, instance: T, type?: string): void {
-    if (this.#entries.has(name)) {
+    if (false) {
       throw new Error(`Instance '${name}' already registered`);
     }
killedBy: Registry register should throw error if name already exists
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/index.ts:26:34
    * @throws Error if name is already registered
    */
   register<T>(name: string, instance: T, type?: string): void {
-    if (this.#entries.has(name)) {
-      throw new Error(`Instance '${name}' already registered`);
-    }
+    if (this.#entries.has(name)) {}
 
     // Safe access to constructor for type inference
killedBy: Registry - Vanilla JavaScript register should throw error if name already exists
statusReason: expected [Function] to throw an error

[Killed] LogicalOperator
src/index.ts:32:29
 
     // Safe access to constructor for type inference
     const instanceObj = instance as { constructor?: { name?: string } };
-    const constructorName = instanceObj.constructor?.name || "Unknown";
+    const constructorName = instanceObj.constructor?.name && "Unknown";
 
     const entry: RegistryEntry<T> = {
killedBy: Registry register should auto-detect type from constructor name
statusReason: expected 'Unknown' to be 'TestClass' // Object.is equality

[Killed] ConditionalExpression
src/index.ts:32:29
 
     // Safe access to constructor for type inference
     const instanceObj = instance as { constructor?: { name?: string } };
-    const constructorName = instanceObj.constructor?.name || "Unknown";
+    const constructorName = false;
 
     const entry: RegistryEntry<T> = {
killedBy: Registry - Vanilla JavaScript register should auto-detect type from constructor name
statusReason: expected false to be 'TestClass' // Object.is equality

[Killed] ConditionalExpression
src/index.ts:37:13
     const entry: RegistryEntry<T> = {
       name,
       instance,
-      type: type || constructorName,
+      type: true,
       constructor: (instanceObj.constructor || Object) as new (...args: unknown[]) => unknown,
     };
killedBy: Registry register should auto-detect type from constructor name
statusReason: expected true to be 'TestClass' // Object.is equality

[Killed] LogicalOperator
src/index.ts:37:13
     const entry: RegistryEntry<T> = {
       name,
       instance,
-      type: type || constructorName,
+      type: type && constructorName,
       constructor: (instanceObj.constructor || Object) as new (...args: unknown[]) => unknown,
     };
killedBy: Registry register should auto-detect type from constructor name
statusReason: expected undefined to be 'TestClass' // Object.is equality

[Killed] BlockStatement
src/index.ts:51:27
    * @returns The stored instance
    * @throws Error if instance is not found
    */
-  get<T>(name: string): T {
-    const entry = this.#entries.get(name);
-    if (!entry) {
-      throw new Error(`Instance '${name}' not found`);
-    }
-    return entry.instance as T;
-  }
+  get<T>(name: string): T {}
 
   /**
killedBy: Registry get should retrieve the same instance that was registered
statusReason: expected undefined to be { value: 'test' } // Object.is equality

[Killed] ConditionalExpression
src/index.ts:53:9
    */
   get<T>(name: string): T {
     const entry = this.#entries.get(name);
-    if (!entry) {
+    if (true) {
       throw new Error(`Instance '${name}' not found`);
     }
killedBy: Registry get should retrieve the same instance that was registered
statusReason: Instance 'test' not found

[Killed] ConditionalExpression
src/index.ts:53:9
    */
   get<T>(name: string): T {
     const entry = this.#entries.get(name);
-    if (!entry) {
+    if (false) {
       throw new Error(`Instance '${name}' not found`);
     }
killedBy: Registry get should throw error if instance not found
statusReason: expected [Function] to throw error including 'Instance \'nonexistent\' not found' but got 'Cannot read properties of undefined (…'

[Killed] BlockStatement
src/index.ts:65:53
    * @param name - Name of the entry
    * @returns Registry entry metadata or undefined if not found
    */
-  getEntry(name: string): RegistryEntry | undefined {
-    return this.#entries.get(name);
-  }
+  getEntry(name: string): RegistryEntry | undefined {}
 
   /**
killedBy: Registry register should auto-detect type from constructor name
statusReason: expected undefined to be 'TestClass' // Object.is equality

[Killed] BlockStatement
src/index.ts:75:30
    * @param name - Name to check
    * @returns true if registered, false otherwise
    */
-  has(name: string): boolean {
-    return this.#entries.has(name);
-  }
+  has(name: string): boolean {}
 
   /**
killedBy: Registry register should store an instance with a unique name
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/index.ts:84:49
    *
    * @returns Array of {name, type} objects
    */
-  list(): Array<{ name: string; type: string }> {
-    return Array.from(this.#entries.values()).map((entry) => ({
-      name: entry.name,
-      type: entry.type,
-    }));
-  }
+  list(): Array<{ name: string; type: string }> {}
 
   /**
killedBy: Registry list should return empty array when no entries
statusReason: expected undefined to deeply equal []

[Killed] ArrowFunction
src/index.ts:85:51
    * @returns Array of {name, type} objects
    */
   list(): Array<{ name: string; type: string }> {
-    return Array.from(this.#entries.values()).map((entry) => ({
-      name: entry.name,
-      type: entry.type,
-    }));
+    return Array.from(this.#entries.values()).map(() => undefined);
   }
 
killedBy: Registry list should return list of all registered entries with metadata
statusReason: expected [ undefined, undefined, undefined ] to deep equally contain { name: 'redis', type: 'Redis' }

[Killed] BlockStatement
src/index.ts:94:17
   /**
    * Clears all registered entries. Useful for testing environments.
    */
-  clear(): void {
-    this.#entries.clear();
-  }
+  clear(): void {}
 }
 
killedBy: Registry register should auto-detect type from constructor name
statusReason: Instance 'test' already registered

[Killed] BlockStatement
src/index.ts:107:41
  *
  * @returns The singleton Registry instance
  */
-export function getRegistry(): Registry {
-  return registryInstance;
-}
+export function getRegistry(): Registry {}
 
killedBy: Registry register should store an instance with a unique name
statusReason: Cannot read properties of undefined (reading 'clear')
